balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64MC802.PIC
      <edc:DCRDef edc:access="--------nnnn-nnn" edc:cname="FPOR" edc:default="0xf7" edc:desc="" edc:impl="0xf7" edc:name="FPOR" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FPWRT" edc:desc="POR Timer Value" edc:mask="0x7" edc:name="FPWRT" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="PWR128" edc:desc="128ms" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PWR64" edc:desc="64ms" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PWR32" edc:desc="32ms" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PWR16" edc:desc="16ms" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PWR8" edc:desc="8ms" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PWR4" edc:desc="4ms" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PWR2" edc:desc="2ms" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PWR1" edc:desc="Disabled" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="ALTI2C" edc:desc="Alternate I2C  pins" edc:mask="0x1" edc:name="ALTI2C" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="I2C mapped to SDA1/SCL1 pins" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="I2C mapped to ASDA1/ASCL1 pins" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LPOL" edc:desc="Motor Control PWM Low Side Polarity bit" edc:mask="0x1" edc:name="LPOL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWM module low side output pins have active-high output polarity" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM module low side output pins have active-low output polarity" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="HPOL" edc:desc="Motor Control PWM High Side Polarity bit" edc:mask="0x1" edc:name="HPOL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWM module high side output pins have active-high output polarity" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM module high side output pins have active-low output polarity" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWMPIN" edc:desc="Motor Control PWM Module Pin Mode bit" edc:mask="0x1" edc:name="PWMPIN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWM module pins controlled by PORT register at device Reset" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM module pins controlled by PWM module at device Reset" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnn---nn" edc:cname="FICD" edc:default="0xffdf" edc:desc="" edc:impl="0xe3" edc:name="FICD" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="Comm Channel Select" edc:mask="0x3" edc:name="ICS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PGD1" edc:desc="Communicate on PGC1/EMUC1 and PGD1/EMUD1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PGD2" edc:desc="Communicate on PGC2/EMUC2 and PGD2/EMUD2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PGD3" edc:desc="Communicate on PGC3/EMUC3 and PGD3/EMUD3" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Port Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1" init="0x0">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG is Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG is Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="COE" edc:desc="Set Clip On Emulation Mode" edc:ishidden="true" edc:mask="0x1" edc:name="COE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Reset Into Operational Mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Reset Into Clip On Emulation Mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BACKBUG" edc:desc="Background Debug" edc:ishidden="true" edc:mask="0x1" edc:name="BACKBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector edc:beginaddr="0xf80010" edc:endaddr="0xf80018" edc:regionid="userid">
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID0" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID0" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID0" edc:desc="" edc:mask="0xff" edc:name="UID0" edc:nzwidth="8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID1" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID1" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID1" edc:desc="" edc:mask="0xff" edc:name="UID1" edc:nzwidth="8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID2" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID2" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID2" edc:desc="" edc:mask="0xff" edc:name="UID2" edc:nzwidth="8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID3" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID3" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID3" edc:desc="" edc:mask="0xff" edc:name="UID3" edc:nzwidth="8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
