balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64MC802.PIC
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nrrrnnnnnrrrnnnn" edc:cname="C1TR23CON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1TR23CON" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="TX2PRI" edc:desc="" edc:mask="0x3" edc:name="TX2PRI" edc:nzwidth="0x2"/>
                  <edc:SFRFieldDef edc:cname="RTREN2" edc:desc="" edc:mask="0x1" edc:name="RTREN2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXREQ2" edc:desc="" edc:mask="0x1" edc:name="TXREQ2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXERR2" edc:desc="" edc:mask="0x1" edc:name="TXERR2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXLARB2" edc:desc="" edc:mask="0x1" edc:name="TXLARB2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXABT2" edc:desc="" edc:mask="0x1" edc:name="TXABT2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXEN2" edc:desc="" edc:mask="0x1" edc:name="TXEN2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TX3PRI" edc:desc="" edc:mask="0x3" edc:name="TX3PRI" edc:nzwidth="0x2"/>
                  <edc:SFRFieldDef edc:cname="RTREN3" edc:desc="" edc:mask="0x1" edc:name="RTREN3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXREQ3" edc:desc="" edc:mask="0x1" edc:name="TXREQ3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXERR3" edc:desc="" edc:mask="0x1" edc:name="TXERR3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXLARB3" edc:desc="" edc:mask="0x1" edc:name="TXLARB3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXABT3" edc:desc="" edc:mask="0x1" edc:name="TXABT3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXEN3" edc:desc="" edc:mask="0x1" edc:name="TXEN3" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="TX2PRI0" edc:desc="" edc:mask="0x1" edc:name="TX2PRI0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="TX2PRI1" edc:desc="" edc:mask="0x1" edc:name="TX2PRI1" edc:nzwidth="1"/>
                  <edc:AdjustPoint edc:offset="6"/>
                  <edc:SFRFieldDef edc:cname="TX3PRI0" edc:desc="" edc:mask="0x1" edc:name="TX3PRI0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="TX3PRI1" edc:desc="" edc:mask="0x1" edc:name="TX3PRI1" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x400 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnn-n-nn" edc:cname="C1RXM1SID" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000-0-00" edc:name="C1RXM1SID" edc:nmmrid="0xc" edc:nzwidth="0x10" edc:por="00000000000-0-00">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="2"/>
                  <edc:AdjustPoint edc:offset="3"/>
                  <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="11"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nrrrnnnnnrrrnnnn" edc:cname="C1TR45CON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1TR45CON" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="TX4PRI" edc:desc="" edc:mask="0x3" edc:name="TX4PRI" edc:nzwidth="0x2"/>
                  <edc:SFRFieldDef edc:cname="RTREN4" edc:desc="" edc:mask="0x1" edc:name="RTREN4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXREQ4" edc:desc="" edc:mask="0x1" edc:name="TXREQ4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXERR4" edc:desc="" edc:mask="0x1" edc:name="TXERR4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXLARB4" edc:desc="" edc:mask="0x1" edc:name="TXLARB4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXABT4" edc:desc="" edc:mask="0x1" edc:name="TXABT4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXEN4" edc:desc="" edc:mask="0x1" edc:name="TXEN4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TX5PRI" edc:desc="" edc:mask="0x3" edc:name="TX5PRI" edc:nzwidth="0x2"/>
                  <edc:SFRFieldDef edc:cname="RTREN5" edc:desc="" edc:mask="0x1" edc:name="RTREN5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXREQ5" edc:desc="" edc:mask="0x1" edc:name="TXREQ5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXERR5" edc:desc="" edc:mask="0x1" edc:name="TXERR5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXLARB5" edc:desc="" edc:mask="0x1" edc:name="TXLARB5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXABT5" edc:desc="" edc:mask="0x1" edc:name="TXABT5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXEN5" edc:desc="" edc:mask="0x1" edc:name="TXEN5" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="TX4PRI0" edc:desc="" edc:mask="0x1" edc:name="TX4PRI0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="TX4PRI1" edc:desc="" edc:mask="0x1" edc:name="TX4PRI1" edc:nzwidth="1"/>
                  <edc:AdjustPoint edc:offset="6"/>
                  <edc:SFRFieldDef edc:cname="TX5PRI0" edc:desc="" edc:mask="0x1" edc:name="TX5PRI0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="TX5PRI1" edc:desc="" edc:mask="0x1" edc:name="TX5PRI1" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x400 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RXM1EID" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1RXM1EID" edc:nmmrid="0xe" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xffff" edc:name="EID" edc:nzwidth="16"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nrrrnnnnnrrrnnnn" edc:cname="C1TR67CON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1TR67CON" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="TX6PRI" edc:desc="" edc:mask="0x3" edc:name="TX6PRI" edc:nzwidth="0x2"/>
                  <edc:SFRFieldDef edc:cname="RTREN6" edc:desc="" edc:mask="0x1" edc:name="RTREN6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXREQ6" edc:desc="" edc:mask="0x1" edc:name="TXREQ6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXERR6" edc:desc="" edc:mask="0x1" edc:name="TXERR6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXLARB6" edc:desc="" edc:mask="0x1" edc:name="TXLARB6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXABT6" edc:desc="" edc:mask="0x1" edc:name="TXABT6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXEN6" edc:desc="" edc:mask="0x1" edc:name="TXEN6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TX7PRI" edc:desc="" edc:mask="0x3" edc:name="TX7PRI" edc:nzwidth="0x2"/>
                  <edc:SFRFieldDef edc:cname="RTREN7" edc:desc="" edc:mask="0x1" edc:name="RTREN7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXREQ7" edc:desc="" edc:mask="0x1" edc:name="TXREQ7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXERR7" edc:desc="" edc:mask="0x1" edc:name="TXERR7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXLARB7" edc:desc="" edc:mask="0x1" edc:name="TXLARB7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXABT7" edc:desc="" edc:mask="0x1" edc:name="TXABT7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXEN7" edc:desc="" edc:mask="0x1" edc:name="TXEN7" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="TX6PRI0" edc:desc="" edc:mask="0x1" edc:name="TX6PRI0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="TX6PRI1" edc:desc="" edc:mask="0x1" edc:name="TX6PRI1" edc:nzwidth="1"/>
                  <edc:AdjustPoint edc:offset="6"/>
                  <edc:SFRFieldDef edc:cname="TX7PRI0" edc:desc="" edc:mask="0x1" edc:name="TX7PRI0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="TX7PRI1" edc:desc="" edc:mask="0x1" edc:name="TX7PRI1" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnn-n-nn" edc:cname="C1RXM2SID" edc:desc="" edc:impl="0xffeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000-0-00" edc:name="C1RXM2SID" edc:nzwidth="0x10" edc:por="00000000000-0-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="11"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
