balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64MC802.PIC
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR23" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR23" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS2R" edc:desc="" edc:mask="0x1f" edc:name="SS2R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SS2R0" edc:desc="" edc:mask="0x1" edc:name="SS2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R1" edc:desc="" edc:mask="0x1" edc:name="SS2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R2" edc:desc="" edc:mask="0x1" edc:name="SS2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R3" edc:desc="" edc:mask="0x1" edc:name="SS2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R4" edc:desc="" edc:mask="0x1" edc:name="SS2R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR26" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR26" edc:nzwidth="16" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1RXR" edc:desc="" edc:mask="0x1f" edc:name="C1RXR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1RXR0" edc:desc="" edc:mask="0x1" edc:name="C1RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1RXR1" edc:desc="" edc:mask="0x1" edc:name="C1RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1RXR2" edc:desc="" edc:mask="0x1" edc:name="C1RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1RXR3" edc:desc="" edc:mask="0x1" edc:name="C1RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1RXR4" edc:desc="" edc:mask="0x1" edc:name="C1RXR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR0" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR0" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP0R" edc:desc="" edc:mask="0x1f" edc:name="RP0R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP1R" edc:desc="" edc:mask="0x1f" edc:name="RP1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP0R0" edc:desc="" edc:mask="0x1" edc:name="RP0R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R1" edc:desc="" edc:mask="0x1" edc:name="RP0R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R2" edc:desc="" edc:mask="0x1" edc:name="RP0R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R3" edc:desc="" edc:mask="0x1" edc:name="RP0R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R4" edc:desc="" edc:mask="0x1" edc:name="RP0R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP1R0" edc:desc="" edc:mask="0x1" edc:name="RP1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R1" edc:desc="" edc:mask="0x1" edc:name="RP1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R2" edc:desc="" edc:mask="0x1" edc:name="RP1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R3" edc:desc="" edc:mask="0x1" edc:name="RP1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R4" edc:desc="" edc:mask="0x1" edc:name="RP1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR1" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR1" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP2R" edc:desc="" edc:mask="0x1f" edc:name="RP2R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP3R" edc:desc="" edc:mask="0x1f" edc:name="RP3R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP2R0" edc:desc="" edc:mask="0x1" edc:name="RP2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R1" edc:desc="" edc:mask="0x1" edc:name="RP2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R2" edc:desc="" edc:mask="0x1" edc:name="RP2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R3" edc:desc="" edc:mask="0x1" edc:name="RP2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R4" edc:desc="" edc:mask="0x1" edc:name="RP2R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP3R0" edc:desc="" edc:mask="0x1" edc:name="RP3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R1" edc:desc="" edc:mask="0x1" edc:name="RP3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R2" edc:desc="" edc:mask="0x1" edc:name="RP3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R3" edc:desc="" edc:mask="0x1" edc:name="RP3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R4" edc:desc="" edc:mask="0x1" edc:name="RP3R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR2" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR2" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP4R" edc:desc="" edc:mask="0x1f" edc:name="RP4R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP5R" edc:desc="" edc:mask="0x1f" edc:name="RP5R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP4R0" edc:desc="" edc:mask="0x1" edc:name="RP4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R1" edc:desc="" edc:mask="0x1" edc:name="RP4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R2" edc:desc="" edc:mask="0x1" edc:name="RP4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R3" edc:desc="" edc:mask="0x1" edc:name="RP4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R4" edc:desc="" edc:mask="0x1" edc:name="RP4R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP5R0" edc:desc="" edc:mask="0x1" edc:name="RP5R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R1" edc:desc="" edc:mask="0x1" edc:name="RP5R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R2" edc:desc="" edc:mask="0x1" edc:name="RP5R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R3" edc:desc="" edc:mask="0x1" edc:name="RP5R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R4" edc:desc="" edc:mask="0x1" edc:name="RP5R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
